In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
index = [1, 2, 3]
names = ['Nour', 'AAA', 'BBB']
NamesSeries = pd.Series(names, index=index)
NamesSeries

1    Nour
2     AAA
3     BBB
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [3]:
NamesSeries.index = [11, 12, 13]
NamesSeries

11    Nour
12     AAA
13     BBB
dtype: object

## Q3: Retrieve First and second elements.

In [4]:
NamesSeries[:2]

11    Nour
12     AAA
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [9]:
x = pd.Series({ 13: 'Nour'})
NamesSeries = pd.concat((NamesSeries, x),ignore_index=True )
NamesSeries

0    Nour
1     AAA
2     BBB
3    Nour
dtype: object

In [14]:
NamesSeries = NamesSeries.drop_duplicates()
NamesSeries

0    Nour
1     AAA
2     BBB
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [15]:
Students = pd.DataFrame(columns=['ID', 'Name', 'GPA'])
Students

Empty DataFrame
Columns: [ID, Name, GPA]
Index: []

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [17]:
file = pd.read_csv("educ_figdp_1_Data.csv")
file.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [22]:
#loc include 94 
file.loc[90:94]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
90,2006,Belgium,Total public expenditure on education as % of ...,5.98,d
91,2007,Belgium,Total public expenditure on education as % of ...,6.00,d
92,2008,Belgium,Total public expenditure on education as % of ...,6.43,d
93,2009,Belgium,Total public expenditure on education as % of ...,6.57,d
94,2010,Belgium,Total public expenditure on education as % of ...,6.58,d

In [23]:
#slice stops at 94
file[90:94]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
90,2006,Belgium,Total public expenditure on education as % of ...,5.98,d
91,2007,Belgium,Total public expenditure on education as % of ...,6.00,d
92,2008,Belgium,Total public expenditure on education as % of ...,6.43,d
93,2009,Belgium,Total public expenditure on education as % of ...,6.57,d